In [2]:
import numpy as np
import pandas as pd

In [4]:
data_dic = {'A':[1,2,np.nan,4,np.nan],
            'B':[np.nan,np.nan,np.nan,np.nan,np.nan],
            'C':[11,12,13,14,15],
            'D':[16,np.nan,18,19,20]}
df = pd.DataFrame(data_dic) # dataframe from a dic.
df

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12   NaN
2  NaN NaN  13  18.0
3  4.0 NaN  14  19.0
4  NaN NaN  15  20.0

#### isnull(), isna(), notnull() -- Check for missing data in the dataset!

In [5]:
# isnull() returns True if the data is missing
df.isnull()

       A     B      C      D
0  False  True  False  False
1  False  True  False   True
2   True  True  False  False
3  False  True  False  False
4   True  True  False  False

In [6]:
df.isnull().sum()

A    2
B    5
C    0
D    1
dtype: int64

In [9]:
df['B'].isnull().sum()

5

In [10]:
df.isna()

       A     B      C      D
0  False  True  False  False
1  False  True  False   True
2   True  True  False  False
3  False  True  False  False
4   True  True  False  False

In [11]:
df.isna().sum()

A    2
B    5
C    0
D    1
dtype: int64

In [13]:
df.loc[4].isnull().sum()

2

In [14]:
# notnull() returns True for non-NaN values
df.notnull()

       A      B     C      D
0   True  False  True   True
1   True  False  True  False
2  False  False  True   True
3   True  False  True   True
4  False  False  True   True

In [15]:
df.shape

(5, 4)

In [16]:
df.notnull().sum()

A    3
B    0
C    5
D    4
dtype: int64

In [17]:
df.notnull().sum().sum()

12

In [18]:
df

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12   NaN
2  NaN NaN  13  18.0
3  4.0 NaN  14  19.0
4  NaN NaN  15  20.0

In [20]:
# Sum on Column "A", (NaN as 0)
df['D'].sum()

73.0

In [21]:
df['D'].mean()

18.25

In [22]:
df.loc[4].sum()

35.0

#### dropna(), fillna() -- Cleaning / filling the missing data

In [26]:
# drop any collumn (dafault value) with any NaN value
df.dropna(axis=1)

    C
0  11
1  12
2  13
3  14
4  15

In [27]:
# drop any row (dafault value) with any NaN value
df.dropna(axis=0)

Empty DataFrame
Columns: [A, B, C, D]
Index: []

In [28]:
df.dropna(thresh=3, axis=1)

     A   C     D
0  1.0  11  16.0
1  2.0  12   NaN
2  NaN  13  18.0
3  4.0  14  19.0
4  NaN  15  20.0

In [31]:
df.fillna(value='Filled')

        A       B   C       D
0     1.0  Filled  11    16.0
1     2.0  Filled  12  Filled
2  Filled  Filled  13    18.0
3     4.0  Filled  14    19.0
4  Filled  Filled  15    20.0

In [32]:
df['A'].fillna(value = df['A'].mean())

0    1.000000
1    2.000000
2    2.333333
3    4.000000
4    2.333333
Name: A, dtype: float64

In [38]:
df

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12   NaN
2  NaN NaN  13  18.0
3  4.0 NaN  14  19.0
4  NaN NaN  15  20.0

In [40]:
# pad / ffill: Forward fill, last valid observation forward to next NaN
#df.fillna(method='ffill') 
df.fillna(method='pad')

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12  16.0
2  2.0 NaN  13  18.0
3  4.0 NaN  14  19.0
4  4.0 NaN  15  20.0

In [41]:
#bfill/backfill -- use NEXT valid observation to fill gap
df.fillna(method='bfill')

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12  18.0
2  4.0 NaN  13  18.0
3  4.0 NaN  14  19.0
4  NaN NaN  15  20.0

In [42]:
df.fillna(0)

     A    B   C     D
0  1.0  0.0  11  16.0
1  2.0  0.0  12   0.0
2  0.0  0.0  13  18.0
3  4.0  0.0  14  19.0
4  0.0  0.0  15  20.0

In [43]:
df

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12   NaN
2  NaN NaN  13  18.0
3  4.0 NaN  14  19.0
4  NaN NaN  15  20.0

In [44]:
# fill with you own given value
df.fillna(0, inplace=True)

In [45]:
df

     A    B   C     D
0  1.0  0.0  11  16.0
1  2.0  0.0  12   0.0
2  0.0  0.0  13  18.0
3  4.0  0.0  14  19.0
4  0.0  0.0  15  20.0